Documents/ПФР_Налоговая_СоцВыплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПФР_Налоговая_СоцВыплаты</Name>
			<BasedOn>
				<xr:Item>Catalog.Обучающиеся</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриказОЗачислении</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДвижениеОбучающихся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассЗачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассныйРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДвиженияОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДвиженияОбучающихся</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчислен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияОбучающегося</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Условно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыДвиженияОбучающегося.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыДвиженияОбучающегося</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НовыйУчебныйГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходМеждуКлассами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаОбучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОбучения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПФР_Налоговая_СоцВыплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ЗагрузитьАктуальныйПриказ(Ссылка)
	Отбор = Новый Структура("Обучающийся", Ссылка);
	Срез = РегистрыСведений.ДвиженияОбучающихся.СрезПоследних(Объект.Дата,Отбор);
	Если Срез.Количество() < 1 Тогда  // Если не найдено данных		
		Возврат Ложь;
	Иначе
		 АктуальныйПриказ = Срез[0].Регистратор;
		 Объект.Класс = Срез[0].Класс;   
		 ЗапросУчебныйГод = Новый Запрос("ВЫБРАТЬ
		                                 |	УчебныеГодаКлассноеРуководство.Класс КАК Класс,
		                                 |	УчебныеГодаКлассноеРуководство.КлассныйРуководитель КАК КлассныйРуководитель
		                                 |ИЗ
		                                 |	Справочник.УчебныеГода.КлассноеРуководство КАК УчебныеГодаКлассноеРуководство
		                                 |ГДЕ
		                                 |	УчебныеГодаКлассноеРуководство.Класс = &Класс
		                                 |	И УчебныеГодаКлассноеРуководство.Ссылка = &УчебныйГод");
		 ЗапросУчебныйГод.УстановитьПараметр("Класс",Объект.Класс);
		 ЗапросУчебныйГод.УстановитьПараметр("УчебныйГод",Срез[0].УчебныйГод);
		 Выборка = ЗапросУчебныйГод.Выполнить().Выбрать();
		 Если Выборка.Следующий() Тогда
			Объект.КлассныйРуководитель = Выборка.КлассныйРуководитель;	 
		Иначе
			Объект.КлассныйРуководитель = Справочники.Сотрудники.ПустаяСсылка();		
		 КонецЕсли;
		 Возврат Истина;
	КонецЕсли
КонецФункции

&НаСервере
Функция ЗагрузитьПриказОЗачислении(Ссылка)
	Отбор = Новый Структура("Обучающийся", Ссылка);
	Отбор.Вставить("ТипДвижения",Перечисления.ТипыДвиженияОбучающегося.ПриемНаОбучение);
	ЗапросПриказ = Новый Запрос("ВЫБРАТЬ
	                            |	ДвиженияОбучающихся.Регистратор КАК Регистратор,
								|	ДвиженияОбучающихся.Класс КАК Класс
	                            |ИЗ
	                            |	РегистрСведений.ДвиженияОбучающихся КАК ДвиженияОбучающихся
	                            |ГДЕ
	                            |	ДвиженияОбучающихся.Обучающийся = &Обучающийся
	                            |	И ДвиженияОбучающихся.ТипДвижения = &ТипДвижения
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	ДвиженияОбучающихся.Период УБЫВ");
	ЗапросПриказ.Параметры.Вставить("Обучающийся", Ссылка);
	ЗапросПриказ.Параметры.Вставить("ТипДвижения", Перечисления.ТипыДвиженияОбучающегося.ПриемНаОбучение);
	Приказы = ЗапросПриказ.Выполнить().Выбрать();
	Если Приказы.Количество() < 1 Тогда  // Если не найдено данных		
		Возврат Ложь;
	Иначе                                      
		 Приказы.Следующий();
		 Объект.ПриказОЗачислении = Приказы.Регистратор;
		 Объект.КлассЗачисления = Приказы.Класс;
		 Возврат Истина;
	КонецЕсли
КонецФункции

&НаСервере
Функция ЗаполнитьДанные(Ссылка)
	Ответ1 = ЗагрузитьАктуальныйПриказ(Ссылка);
	Ответ2 = ЗагрузитьПриказОЗачислении(Ссылка);
	Если Ответ1 И Ответ2 Тогда
		РассчитатьОкончаниеУчебы();		
	Иначе
		Объект.ДатаОкончанияОбучения = Дата(Год(ТекущаяДата()),06,30);	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбучающийсяПриИзменении(Элемент)
	Ответ = ЗаполнитьДанные(Объект.Обучающийся);
КонецПроцедуры

&НаСервере
Функция РассчитатьОкончаниеУчебы()
	ДатаВыпускаЭтогоГода = Дата(Год(Объект.Дата),06,30);
	ДатаВыпускаГодаЗачисления = Дата(Год(Объект.ПриказОЗачислении.ДатаДействия),06,30);
	КлассЗачисления = Число(СтрРазделить(Объект.КлассЗачисления.Наименование," ",Ложь)[0]);
	КлассСейчас = Число(СтрРазделить(Объект.Класс.Наименование," ",Ложь)[0]);
	НужноУчитьсяЛет = Неопределено;
	Если КлассЗачисления <= 9 Тогда
		НужноУчитьсяЛет = 9 - КлассСейчас;
	Иначе
		НужноУчитьсяЛет = 11 - КлассСейчас;
	КонецЕсли;
	Если Объект.Дата > ДатаВыпускаЭтогоГода Тогда // Если сейчас первое полугодие - прибавляем год
		НужноУчитьсяЛет = НужноУчитьсяЛет + 1;
	КонецЕсли;
	
	Объект.ДатаОкончанияОбучения = Дата(Год(Объект.Дата)+НужноУчитьсяЛет,06,30);
	
	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ответ = ЗаполнитьДанные(Объект.Обучающийся);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Ответ = ЗаполнитьДанные(Объект.Обучающийся);
КонецПроцедуры
